backend/app/Controllers/Api/Candidatos.php

    public function show(string $slug): ResponseInterface
    {
        $model = new CandidatoModel();
        $candidato = $model->where('slug', $slug)->first();

        if (! $candidato) {
            return $this->response->setStatusCode(404)->setJSON(['erro' => 'Candidato não encontrado']);
        }

        $id = (int) $candidato['id'];

        return $this->response->setJSON([
            'candidato' => $candidato,
            'bens'      => (new BemModel())->where('candidato_id', $id)->orderBy('valor', 'DESC')->findAll(),
            'historico' => (new CandidaturaAnteriorModel())->where('candidato_id', $id)->orderBy('ano', 'DESC')->findAll(),
            'doadores'  => (new DoadorModel())->where('candidato_id', $id)->orderBy('percentual', 'DESC')->findAll(),
            'gastos'    => (new GastoModel())->where('candidato_id', $id)->orderBy('percentual', 'DESC')->findAll(),
---
SELECT *
FROM `candidatos`
WHERE `slug` = 'escritor-augusto-cury'
 LIMIT 1
SELECT *
FROM `bens`
WHERE `candidato_id` = 3
ORDER BY `valor` DESC
SELECT *
FROM `doadores`
WHERE `candidato_id` = 3
ORDER BY `percentual` DESC
SELECT *
FROM `gastos`
WHERE `candidato_id` = 3
ORDER BY `percentual` DESC