backend/app/Controllers/Api/Empresas.php

    public function show(string $doc): ResponseInterface
    {
        $doc = preg_replace('/\D/', '', $doc);

        if ($doc === '' || strlen($doc) > 20) {
            return $this->response->setStatusCode(422)->setJSON(['erro' => 'Documento inválido']);
        }

        $doadores = (new DoadorModel())
            ->select("doadores.*, candidatos.slug AS candidato_slug, candidatos.nome AS candidato_nome, candidatos.partido, candidatos.cargo, candidatos.uf, candidatos.receitas_total, candidatos.despesas_total, 'doador' AS tipo")
            ->join('candidatos', 'candidatos.id = doadores.candidato_id')
            ->where('doadores.documento', $doc)
            ->orderBy('percentual', 'DESC')
            ->findAll();

        $gastos = (new GastoModel())
            ->select("gastos.*, candidatos.slug AS candidato_slug, candidatos.nome AS candidato_nome, candidatos.partido, candidatos.cargo, candidatos.uf, candidatos.receitas_total, candidatos.despesas_total, 'gasto' AS tipo")
            ->join('candidatos', 'candidatos.id = gastos.candidato_id')
            ->where('gastos.documento', $doc)
            ->orderBy('percentual', 'DESC')
            ->findAll();
---
SELECT `doadores`.*, `candidatos`.`slug` AS `candidato_slug`, `candidatos`.`nome` AS `candidato_nome`, `candidatos`.`partido`, `candidatos`.`cargo`, `candidatos`.`uf`, 'doador' AS tipo
FROM `doadores`
JOIN `candidatos` ON `candidatos`.`id` = `doadores`.`candidato_id`
WHERE `doadores`.`documento` = '09383641000147'
ORDER BY `percentual` DESC
SELECT `gastos`.*, `candidatos`.`slug` AS `candidato_slug`, `candidatos`.`nome` AS `candidato_nome`, `candidatos`.`partido`, `candidatos`.`cargo`, `candidatos`.`uf`, 'gasto' AS tipo
FROM `gastos`
JOIN `candidatos` ON `candidatos`.`id` = `gastos`.`candidato_id`
WHERE `gastos`.`documento` = '09383641000147'
ORDER BY `percentual` DESC