backend/app/Controllers/Api/Estatisticas.php

SELECT *
FROM `candidatos`
WHERE `cargo` = 'presidente'
---
    public function index(): ResponseInterface
    {
        $cargo = $this->request->getGet('cargo') ?? 'presidente';
        $model = new CandidatoModel();
        $rows  = $model->where('cargo', $cargo)->findAll();