backend/app/Controllers/Api/Pesquisas.php

SELECT `pesquisa_resultados`.*, `candidatos`.`slug` AS `candidato_slug`
FROM `pesquisa_resultados`
LEFT JOIN `candidatos` ON `candidatos`.`id` = `pesquisa_resultados`.`candidato_id`
WHERE `pesquisa_id` = 12
ORDER BY `percentual` DESC
---
    public function evolucao(): ResponseInterface
    {
        $rows = $this->baseQuery()->orderBy('data_fim', 'ASC')->findAll();
        $resultadoModel = new PesquisaResultadoModel();

        foreach ($rows as &$p) {
            $p['resultados'] = $resultadoModel
                ->select('pesquisa_resultados.*, candidatos.slug AS candidato_slug')
                ->join('candidatos', 'candidatos.id = pesquisa_resultados.candidato_id', 'left')
                ->where('pesquisa_id', (int) $p['id'])
                ->orderBy('percentual', 'DESC')
                ->findAll();