backend/app/Controllers/Api/Rankings.php

SELECT *
FROM `candidatos`
WHERE `cargo` = 'presidente'
ORDER BY `patrimonio_total` DESC
 LIMIT 13
---
    public function patrimonio(): ResponseInterface
    {
        $cargo  = $this->request->getGet('cargo') ?? 'presidente';
        $uf     = trim((string) ($this->request->getGet('uf') ?? ''));
        $limite = (int) ($this->request->getGet('limite') ?? 13);
        $limite = max(1, min($limite, 100));

        $builder = (new CandidatoModel())->where('cargo', $cargo);
        if ($uf !== '') {
            $builder = $builder->where('uf', $uf);
        }
        $rows = $builder->orderBy('patrimonio_total', 'DESC')->findAll($limite);

SELECT *
FROM `candidatos`
WHERE `cargo` = 'presidente'
ORDER BY `receitas_total` DESC
 LIMIT 13
---
    public function receitas(): ResponseInterface
    {
        $cargo  = $this->request->getGet('cargo') ?? 'presidente';
        $uf     = trim((string) ($this->request->getGet('uf') ?? ''));
        $limite = (int) ($this->request->getGet('limite') ?? 13);
        $limite = max(1, min($limite, 100));

        $builder = (new CandidatoModel())->where('cargo', $cargo);
        if ($uf !== '') {
            $builder = $builder->where('uf', $uf);
        }
        $rows = $builder->orderBy('receitas_total', 'DESC')->findAll($limite);